package com.github.batulovandrey.horrorstories;

import java.util.ArrayList;
import java.util.List;

/**
 * @author Batulov Andrey on 19.06.17.
 */

public class StoryAdapter {
    private static final List<Story> STORIES = new ArrayList<>();
    {
        STORIES.add(new Story("Про дух Регины, которая мирит детей\n",
                "Как-то раз в лагерь приехала девочка, которую звали Регина. Она была не очень общительной: " +
                        "со всеми спорила и вообще была противной. Она часто убегала из корпуса, не слушалась. " +
                        "Каждый раз, когда она с кем-то ссорилась, она убегала на качели, которые стояли на площадке в лагере, " +
                        "и качалась на них. Так вот, когда она поссорилась со своей подругой, она, как обычно, убежала кататься на качелях. " +
                        "Сначала никто не заметил, что её нет. Но к вечеру её искал весь лагерь, через несколько часов поиска вожатая вспомнила, " +
                        "куда уходит Регина, и побежала к качелям, но, когда она пришла туда, ни качелей, ни Регины там не было. " +
                        "Прошло много лет, Регину не нашли, ходят слухи, что дух Регины ходит по лагерю, и, если кто-нибудь ссорится, 2222" +
                        "она приходит к этим людям ночью и смотрит им в глаза, после чего дети не могут уснуть, пока искренне не извинятся.\n"));
        STORIES.add(new Story("Про фотографию призрака\n",
                "Приехала в лагерь девочка, звали её Олеся. Как-то раз все пошли на мероприятие, а она не хотела идти и спряталась," +
                        "чтобы её не увидели. Так и вышло. Все ушли, сидит она одна. Тогда по лагерю ходили слухи о маньяках, которые пришли в лагерь." +
                        "Сидит она, заняться нечем, пошла в лес (а было вечернее мероприятие, и было уже темно). Идёт она, и вдруг её как схватят" +
                        "чьи-то руки — она даже закричать не успела. Ну эти уроды изнасиловали её и убежали, бедная девочка, не в силах кричать," +
                        "на коленях поползла к корпусу, не смогла дойти, прямо перед корпусом умерла. Теперь, когда вы фотографируетесь около" +
                        "двухэтажного корпуса (где мелкие всегда живут), она проявляется на фотографиях."));
        STORIES.add(new Story("Про след на асфальте\n",
                "Когда-то в лагерь приехали мальчик и девочка. Мальчику очень полюбилась эта девочка. Всю смену он за ней ухаживал." +
                        "А девочка унижала его и командовала им. Она говорит: «Прыгай!» — он прыгает. Говорит: «Танцуй» — он танцует." +
                        "И вот настал конец смены. Мальчик думал, что девочка хоть сейчас скажет ему пару добрых слов, но она при всех дала ему пощёчину." +
                        "Мальчику было очень стыдно: и от печали и даже злости он прожёг на асфальте след. Этот след до сих пор есть на центральной аллее," +
                        "хотя асфальт несколько раз перекладывали. И теперь призрак этого мальчика иногда появляется, он идёт по центральной аллее," +
                        "доходит до следа и появляется за забором."));
        STORIES.add(new Story("Про пионера в чёрном галстуке\n",
                "ак-то в лагерь приехал мальчик. Он ходил всё время в чёрной одежде, а на шее у него был повязан пионерский галстук." +
                        "С ним никто не дружил. И вот как-то раз к нему подходит компания друзей и говорит: «Выполнишь наше задание," +
                        "и мы с тобой будем дружить». Мальчик согласился. Ночью они вышли за территорию лагеря. Ему говорят:" +
                        "«Тебе нужно отпрыгнуть от поезда, когда он будет совсем близко». И вот едет первый поезд, мальчик испугался и отпрыгнул," +
                        "когда поезд был ещё очень далеко. Ему говорят: «Так не пойдёт». Едет второй поезд, мальчик отпрянул чуть ближе к поезду." +
                        "Ему говорят: «Так тоже не пойдёт, давай ещё раз!» Вот едет третий поезд, у мальчика застряла нога в рельсах, и его задавил состав." +
                        "Теперь призрак мальчика приходит каждый день после дождя в 23:00. Он гуляет по всему лагерю. Затем проходит по центральной аллее," +
                        "исчезает и потом появляется за воротами."));
        STORIES.add(new Story("Про любовника уборщицы\n",
                "У нас в лагере есть старый туалет — «Зелёнка». Так вот: несколько лет назад там было свидание уборщицы с её кавалером," +
                        "он был с цветами, всё как положено. Но когда пришёл — обнаружил труп любимой. На этом месте остался букет роз. \n" +
                        "И с тех пор каждый месяц определённого числа в определённое время призрак этого кавалера ходит по лагерю в чёрном плаще" +
                        "и с топором и ищет среди уборщиц свою возлюбленную."));
        STORIES.add(new Story("Про симку «МТС»\n",
                "Мы жили в четвёртом корпусе. Сначала у нас на потолке появился след 40-го размера." +
                        "Ну мы раз сто смотрели на потолок, и его не было. Всё бы ничего, если бы через пару дней не произошло ещё кое-что!" +
                        "Сначала моя подружка по комнате нашла на своей кровати симку «МТС», которая лежала идеально ровно, что в принципе невозможно." +
                        "На следующий день уже я нашла симку Life, которая, кстати, тоже лежала идеально ровно, что в принципе невозможно, потому что" +
                        "дело было перед дискотекой, в тумбочке у меня был такой беспорядок! Как на помойке. И если мы их не замечали, то мы слепые!" +
                        "И перед тихим часом под матрасом (где я всегда очень хорошо смотрела) нашла карту памяти! Когда мы посмотрели, что на карте," +
                        "мы были в шоке! Там было всё тупо про «Майнкрафт»!"));
    }

    public static List<Story> getStories() {
        return STORIES;
    }

    public static Story getStoryById(int id) {
        if (id >= 0 && id < STORIES.size())
            return STORIES.get(id);
        return new Story("empty", "empty");
    }

    public static Story getStoryByName(String name) {
        Story resultStory = new Story("empty", "empty");
        for (Story story : STORIES) {
            if (name.equalsIgnoreCase(story.getName()))
                resultStory = story;
        }
        return resultStory;
    }
}
